<template>
    <aside class="card">
        <div class="card-header">
            <h3 class="card-title">วิธีการชำระเงินด้วย QR</h3>
        </div>
        <div class="card-body">
            <div class="procedure">
                <h4>ขั้นตอนการสแกน QR ที่แนะนำ</h4>
                <ol>
                    <li>เปิดแอปพลิเคชันธนาคารบนอุปกรณ์ของท่าน</li>
                    <li>ไปยังเมนู “สแกน” หรือ “สแกนจ่าย” จากนั้นให้สแกน QR ที่ปรากฎอยู่บนหน้าจอ</li>
                    <li>ด้วยสอบความถูกต้องและทำรายการต่อไป โดยกรุณาเช็คชื่อบัญชีผู้รับต้องเป็น
                        <strong>“<u>บริษัท 724 มาร์เก็ต จำกัด</u>”</strong> เท่านั้น
                    </li>
                    <li>หลังจากชำระเงินเสร็จสิ้น ระบบจะนำท่านไปหน้าผลการทำรายการโดยอัตโนมัติ</li>
                </ol>
                <h4>หรือ</h4>
                <ol>
                    <li>คลิกปุ่ม <b>“บันทึก QR”</b> หรือแคปหน้าจอ</li>
                    <li>เปิดแอปพลิเคชันธนาคารบนอุปกรณ์ของท่าน</li>
                    <li>ไปยังเมนู “สแกน” หรือ “สแกนจ่าย” จากนั้นกดปุ่ม “รูปภาพ” เพื่อเลือกรูป QR
                        ในอุปกรณ์ของท่าน</li>
                    <li>ด้วยสอบความถูกต้องและทำรายการต่อไป โดยกรุณาเช็คชื่อบัญชีผู้รับต้องเป็น
                        <strong>“<u>บริษัท 724 มาร์เก็ต จำกัด</u>”</strong> เท่านั้น
                    </li>
                    <li>หลังจากชำระเงินเสร็จสิ้น ระบบจะนำท่านไปหน้าผลการทำรายการโดยอัตโนมัติ</li>
                </ol>
            </div>
            <div class="notice-warning">
                <i class="fa-regular fa-circle-info"></i> QR นี้
                ใช้ได้เฉพาะรายการคำสั่งซื้อนี้เท่านั้น<br><b><u>ไม่สามารถใช้ซ้ำได้</u></b>
            </div>
        </div>
    </aside>
</template>