<template>
  <!-- Modal -->
  <div
    class="modal fade"
    id="ModalCoverage"
    data-bs-backdrop="static"
    data-bs-keyboard="false"
    tabindex="-1"
    aria-labelledby="ModalCoverageLabel"
    aria-hidden="true"
  >
    <div class="modal-dialog modal-xl">
      <div class="modal-content">
        <div class="modal-header">
          <h1 class="modal-title fs-5" id="ModalCoverageLabel">
            รายละเอียดความคุ้มครอง
          </h1>
          <button
            type="button"
            class="btn-close"
            data-bs-dismiss="modal"
            aria-label="Close"
          ></button>
        </div>
        <div class="modal-body">
          <p>
            จำนวนเงินคุ้มครองผู้ประสบภัย <br>
            1) 80,000 บาท ต่อหนึ่งคน สำหรับความเสียหายต่อร่างกายหรืออนามัย <br>
            2) 500,000 บาท ต่อหนึ่งคน สำหรับการเสียชีวิต หรือทุพพลภาพอย่างถาวรสิ้นเชิง <br>
            3) 200,000 บาท ถึง 500,000บาท ต่อหนึ่งคน สำหรับการสูญเสียอวัยวะตามเงื่อนไขกรมธรรม์ฯ ข้อ 3) <br>
            4) 200 บาทต่อวัน รวมกันไม่เกิน 20 วัน สำหรับการชดเชยรายวันกรณีเข้ารักษาในสถานพยาบาลในฐานะคนไข้ใน<br>
            ทั้งนี้จำนวนเงินคุ้มครองสูงสุดสำหรับ 1) 2) 3) และ 4) รวมกันไม่เกิน 504,000 บาทต่อหนึ่งคน และรวมกันไม่เกินห้าล้านบาท
            <br>สำหรับรถที่มีที่นั่งไม่เกินเจ็ดคน หรือ รถบรรทุกผู้โดยสารรวมทั้งผู้ขับขี่ไม่เกินเจ็ดคน และไม่เกินสิบล้านบาท สำหรับรถที่มี่ที่นั่งเกินเจ็ดคน
            <br> หรือรถบรรทุกผู้โดยสารรวมทั้งผู้ขับขี่เกินเจ็ดคนต่ออุบัติเหตุแต่ละครั้ง
            <br>กรณีผู้ประสบภัย เป็นผู้ขับขี่รถคันที่เอาประกันภัยและเป็นฝ่ายที่ต้องรับผิดต่ออุบัติเหตุ
            <br>หรือไม่มีผู้ใดต้องรับผิดตามกฏหมายต่อผู้ขับขี่ที่เป็นผู้ประสบภัย บริษัทจะรับผิดจ่ายค่าสินไหมทดแทนไม่เกินค่าเสียหายเบื้องต้นเท่านั้น
            <br>จำนวนเงินค่าเสียหายเบื้องต้น 
            <br>1) ความเสียหายต่อร่างกาย ไม่เกิน 30,000 บาทต่อหนึ่งคน หรือตามที่กฎหมายกำหนด
            <br>2) ความเสียหายต่อร่างกายสำหรับการสูญเสียอวัยวะ หรือทุพพลภาพอย่างถาวร 35,000 บาท ต่อหนึ่งคน หรือตามที่กฎหมายกำหนด
            <br>3) ความเสียหายต่อชีวิต 35,000 บาท ต่อหนึ่งคน หรือตามที่กฎหมายกำหนด
            <br>ทั้งนี้ จำนวนเงินค่าเสียหายเบื้องต้นเป็นส่วนหนึ่งของจำนวนเงินคุ้มครองผู้ประสบภัย
          </p>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-danger" data-bs-dismiss="modal">
            ปิด
          </button>
        </div>
      </div>
    </div>
  </div>
</template>
